Revit 2027 API
FindReferenceTarget Enumeration
 The type of reference to find from a ReferenceIntersector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FindReferenceTarget
Public Enumeration FindReferenceTarget
public enum class FindReferenceTarget
type FindReferenceTarget
Members
Member name | Value | Description
All | 31 |  All target types.
Curve | 8 |  A curve.
Edge | 4 |  An edge.
Element | 1 |  An element.
Face | 16 |  A face.
Mesh | 2 |  A mesh.
See Also
Reference
Autodesk.Revit.DB Namespace